"""
    字典基本操作
        创建
        添加
        定位
        遍历
        删除
"""
# 列表擅长存储单一维度数据
list_name = ["王利花", "张盼盼", "王万元"]
list_age = [33, 23, 28]
list_sex = ["女", "女", "男"]

# 字典擅长存储多个维度数据
# 1. 创建
# -- 语法1:字典名 = {键1:值1,键2:值2}
dict_wlh = {
    "name": "王利花",
    "age": 33,
    "sex": "女",
}
dict_zpp = {
    "name": "张盼盼",
    "age": 23,
    "sex": "女",
}
dict_wwy = {
    "name": "王万元",
    "age": 28,
    "sex": "男",
}
# -- 语法2:字典名 = dict(可迭代对象)
list_name = [("王利", "花"), ["张", "盼盼"], "万元"]
# 要求:可迭代对象中的元素必须能够一分为二
print(dict(list_name))
