"""
    函数参数
        形式参数
            位置形参:实参必填
                def 函数名(参数名1,参数名2):
            默认形参:实参可选
                def 函数名(参数名1=数据,参数名2=数据):
        实际参数
            位置实参:按顺序与形参进行对应
                函数名(数据1,数据2):
            关键字实参:按名称与形参进行对应
                函数名(参数名2=数据)
"""


# 星号元组形参：将多个位置实参合并为一个元组
def func01(*p):
    print(p)


# 双星号字典形参：将多个关键字实参合并为一个字典
def func02(**p):
    print(p)


func01()
func01(10)
func01(10, 20)
# func01(p = 10) # 不支持关键字实参
func02()
func02(a=1, b=2)
# 练习:定义函数,实现多个数字累乘
