"""
    小结 - 函数参数
        形式参数：限制实参
            1位置形参:实参必填
                def 函数名(参数名1,参数名2):
            2默认形参:实参可选
                def 函数名(参数名1=数据,参数名2=数据):
            3.星号元组形参：多位置实参合一元组
                 def 函数名(*args)
            4.双星号字典形参：多关键字实参合一字典
                 def 函数名(**kwargs)
            5.命名关键字形参：实参必须是关键字实参
                def 函数名(*args,命名关键字形参)
                def 函数名(*,命名关键字形参)
        实际参数：与形参进行对应
            1位置实参:按顺序
                函数名(数据1,数据2):
                  3.序列实参：一序列拆多参数
                    函数名(*序列)
            2关键字实参:按名称
                函数名(参数名2=数据)
                4.字典实参：一字典拆多参数
                    函数名(**字典)
"""
