"""
    小结-流程控制语句
        选择语句：让代码根据条件有选择性的执行
            if 条件:
                满足条件执行
            else:
                不满足条件执行
            -------------------
            if 条件1:
                满足条件1执行
            elif 条件2:
                不满足条件1,但满足条件2执行
            else:
                以上条件都不满足执行
        循环语句:让代码重复性执行
            根据条件重复
                while 条件:
                    循环体
                例如:纸张厚度不超过珠穆朗玛峰则对折
            根据次数重复
                for 变量 in range(...):
                    循环体
                例如:纸张对折10次
        跳转语句:在循环中使用
            break：跳出，结束后续循环
            continue：跳过，继续下次循环
"""