"""
    小结 - 列表常用操作
        创建
            根据元素
                列表名 = [数据1,数据2]
            根据其他容器
                列表名 = list(可迭代对象)
        添加
            追加
                列表名.append(数据)
            插入
                列表名.insert(索引,数据)
        定位
            单个元素
                列表名[索引]
            多个元素
                列表名[切片]
        遍历
            从头到尾读取
                for item in 列表名:
                    item存储的是列表元素
            非从头到尾读取
                for i in range():
                    i是索引
                    列表名[i]是元素
        删除
            根据定位
                del 列表名[索引/切片]
            根据元素
                列表名.remove(元素)
"""









