"""
练习1：提取年月日：2022-06-1、2022-6-11、2022/08/11
结果：[('2022', '06', '1'), ('2022', '6', '11'), ('2022', '08', '11')]

练习2：提取所有li标签内的信息：  <li>内容1\</li> \<li>内容2\</li>
结果：['内容1', '内容2']

练习3：提取div标签内的信息： \<div id ="header">标题\</div> \<div id="course">课程\</div>
结果：['标题', '课程']
"""
import re

print(re.findall("(\d{4})[-/](\d{1,2})[-/](\d{1,2})","2022-06-1、2022-6-11、2022/08/11"))
print(re.findall("<li>(.*?)</li>","<li>内容1</li> <li>内容2</li>"))
print(re.findall("<div.*?>(.*?)</div>",'<div id ="header">标题</div> <div id="course">课程</div>'))
